#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mczaplinski/tf-eks-starter/runs/run-AVf8Ts3qGGtyyZXW

Waiting for the plan to start...

Terraform v1.4.0
on linux_amd64
Initializing plugins and modules...
random_string.suffix: Refreshing state... [id=uBlj6kee]
random_password.argocd: Refreshing state... [id=none]
bcrypt_hash.argo: Refreshing state... [id=$2a$10$6nnHnPA8qBr5hbNaRhZmIOj5kAarKJdehF3GSCkUdFbuEXHYSbrQ2]
data.aws_availability_zones.available: Refreshing...
module.k8s-addons.data.aws_region.current: Refreshing...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-eks-uBlj6kee/cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0cb4d6a747bb6fdba]
module.eks.data.aws_partition.current: Refreshing...
module.eks.module.kms.data.aws_caller_identity.current: Refreshing...
module.k8s-addons.data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Refreshing...
module.k8s-addons.data.aws_region.current: Refresh complete after 0s [id=eu-central-1]
module.k8s-addons.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Refreshing...
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Refreshing...
module.eks.data.aws_caller_identity.current: Refreshing...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Refreshing...
module.eks.module.kms.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.k8s-addons.data.aws_caller_identity.current: Refreshing...
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0]: Refreshing state... [id=node-group-2-eks-node-group-20230309224417430600000002]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2764486067]
module.eks.module.kms.data.aws_caller_identity.current: Refresh complete after 0s [id=252112956783]
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Refresh complete after 0s [id=252112956783]
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Refresh complete after 0s [id=252112956783]
module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0]: Refreshing state... [id=node-group-1-eks-node-group-20230309224417430100000001]
module.eks.data.aws_caller_identity.current: Refresh complete after 0s [id=252112956783]
module.k8s-addons.data.aws_caller_identity.current: Refresh complete after 0s [id=252112956783]
module.eks.data.aws_iam_session_context.current: Refreshing...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-eks-uBlj6kee-cluster-20230309224417431000000003]
module.eks.data.aws_iam_session_context.current: Refresh complete after 0s [id=arn:aws:iam::252112956783:user/tf]
data.aws_availability_zones.available: Refresh complete after 0s [id=eu-central-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09945ff4eb9a82d73]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-2-eks-node-group-20230309224417430600000002-20230309224418039300000005]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-2-eks-node-group-20230309224417430600000002-20230309224418050600000007]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-1-eks-node-group-20230309224417430100000001-2023030922441816050000000b]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-1-eks-node-group-20230309224417430100000001-20230309224418043300000006]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-2-eks-node-group-20230309224417430600000002-20230309224418082000000009]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-1-eks-node-group-20230309224417430100000001-20230309224418020600000004]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=my-eks-uBlj6kee-cluster-20230309224417431000000003-20230309224418052500000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=my-eks-uBlj6kee-cluster-20230309224417431000000003-2023030922441808920000000a]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refreshing...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refresh complete after 0s [id=1914862078]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=b3c46b21-bdfc-4888-ad2e-727c3a251ada]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/my-eks-uBlj6kee]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::252112956783:policy/my-eks-uBlj6kee-cluster-ClusterEncryption2023030922443588550000000e]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=my-eks-uBlj6kee-cluster-20230309224417431000000003-2023030922443601540000000f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-017f986af82a53977]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-05907a6b95cca12fb]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02a8b55b60c0e8921]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00baa549482ae1f3a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ff0bfd51d5b22657]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-02c2cfd069f6b0a15]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-035a4d225dff8b89b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02452e99fa39719a3]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-084f6f4389bce624d]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-03a8cd80c628daf29]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0eac9ea484db80d28]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02a8b55b60c0e89211080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d44dccc3e810298e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a384af435f393153]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d6db6643b119db00]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0547466954c4e91d6]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ce4fe57778865317]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0ba1bf49f44737a5c]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2132206202]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0817d5b1780cea6fe]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2047228329]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2439296862]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3730414150]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4186403077]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-802938658]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-947614334]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-4123362453]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2175275226]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-4064289392]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ff0bfd51d5b226571080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=my-eks-uBlj6kee]
data.aws_eks_cluster_auth.this: Refreshing...
data.aws_eks_cluster_auth.this: Refresh complete after 0s [id=my-eks-uBlj6kee]
module.eks.data.tls_certificate.this[0]: Refreshing...
module.k8s-addons.time_sleep.dataplane: Refreshing state... [id=2023-03-10T00:01:18Z]
module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0]: Refreshing state... [id=lt-076d6a376cd36b4c2]
module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0]: Refreshing state... [id=lt-068983b0e5172fd7e]
module.k8s-addons.module.argocd[0].kubernetes_namespace_v1.this[0]: Refreshing state... [id=argocd]
module.k8s-addons.data.aws_eks_cluster.eks_cluster: Refreshing...
module.eks.data.tls_certificate.this[0]: Refresh complete after 0s [id=ff7dc60e5396294bf9a5d43becd0dbdb763fe4ea]
module.k8s-addons.data.aws_eks_cluster.eks_cluster: Refresh complete after 0s [id=my-eks-uBlj6kee]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::252112956783:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/FB35DB3FDB97B9363D0F6C2617247A9A]
module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0]: Refreshing state... [id=my-eks-uBlj6kee:node-group-1-20230309225637621100000015]
module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0]: Refreshing state... [id=my-eks-uBlj6kee:node-group-2-20230309225637621400000017]
module.k8s-addons.module.argocd[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=argo-cd]
module.k8s-addons.module.argocd[0].helm_release.argocd_application["addons"]: Refreshing state... [id=addons]
module.k8s-addons.module.argocd[0].kubernetes_namespace_v1.this[0]: Drift detected (update)
module.k8s-addons.module.argocd[0].module.helm_addon.helm_release.addon[0]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_secretsmanager_secret.argocd will be created
  + resource "aws_secretsmanager_secret" "argocd" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "argocd"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.argocd will be created
  + resource "aws_secretsmanager_secret_version" "argocd" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.k8s-addons.module.argocd[0].helm_release.argocd_application["addons"] will be destroyed
  # (because key ["addons"] is not in for_each map)
  - resource "helm_release" "argocd_application" {
      - atomic                     = false -> null
      - chart                      = ".terraform/modules/k8s-addons/modules/kubernetes-addons/argocd/argocd-application/helm" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "addons" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "0.1.0"
              - chart       = "argo-application"
              - name        = "addons"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - destination       = {
                          - server = "https://kubernetes.default.svc"
                        }
                      - ignoreDifferences = []
                      - name              = "addons"
                      - project           = "default"
                      - source            = {
                          - helm           = {
                              - releaseName = "addons"
                              - values      = <<-EOT
                                    "account": "252112956783"
                                    "clusterName": "my-eks-uBlj6kee"
                                    "region": "eu-central-1"
                                    "repoUrl": "https://github.com/mczaplinski/tf-eks-starter.git"
                                EOT
                            }
                          - path           = "app/hello/chart"
                          - repoUrl        = "https://github.com/mczaplinski/tf-eks-starter.git"
                          - targetRevision = "HEAD"
                        }
                    }
                )
              - version     = "0.1.0"
            },
        ] -> null
      - name                       = "addons" -> null
      - namespace                  = "argocd" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - <<-EOT
                "ignoreDifferences": []
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "0.1.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null

      - set {
          - name  = "destination.server" -> null
          - type  = "string" -> null
          - value = "https://kubernetes.default.svc" -> null
        }
      - set {
          - name  = "name" -> null
          - type  = "string" -> null
          - value = "addons" -> null
        }
      - set {
          - name  = "project" -> null
          - type  = "string" -> null
          - value = "default" -> null
        }
      - set {
          - name  = "source.helm.releaseName" -> null
          - type  = "string" -> null
          - value = "addons" -> null
        }
      - set {
          - name  = "source.helm.values" -> null
          - type  = "auto" -> null
          - value = <<-EOT
                "account": "252112956783"
                "clusterName": "my-eks-uBlj6kee"
                "region": "eu-central-1"
                "repoUrl": "https://github.com/mczaplinski/tf-eks-starter.git"
            EOT -> null
        }
      - set {
          - name  = "source.path" -> null
          - type  = "string" -> null
          - value = "app/hello/chart" -> null
        }
      - set {
          - name  = "source.repoUrl" -> null
          - type  = "string" -> null
          - value = "https://github.com/mczaplinski/tf-eks-starter.git" -> null
        }
      - set {
          - name  = "source.targetRevision" -> null
          - type  = "string" -> null
          - value = "HEAD" -> null
        }
    }

  # module.k8s-addons.module.argocd[0].helm_release.argocd_application["hello"] will be created
  + resource "helm_release" "argocd_application" {
      + atomic                     = false
      + chart                      = ".terraform/modules/k8s-addons/modules/kubernetes-addons/argocd/argocd-application/helm"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "hello"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "ignoreDifferences": []
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "destination.server"
          + type  = "string"
          + value = "https://kubernetes.default.svc"
        }
      + set {
          + name  = "name"
          + type  = "string"
          + value = "hello"
        }
      + set {
          + name  = "project"
          + type  = "string"
          + value = "default"
        }
      + set {
          + name  = "source.helm.releaseName"
          + type  = "string"
          + value = "hello"
        }
      + set {
          + name  = "source.helm.values"
          + type  = "auto"
          + value = <<-EOT
                "account": "252112956783"
                "clusterName": "my-eks-uBlj6kee"
                "region": "eu-central-1"
                "repoUrl": "https://github.com/mczaplinski/tf-eks-starter.git"
            EOT
        }
      + set {
          + name  = "source.path"
          + type  = "string"
          + value = "app/hello/chart"
        }
      + set {
          + name  = "source.repoUrl"
          + type  = "string"
          + value = "https://github.com/mczaplinski/tf-eks-starter.git"
        }
      + set {
          + name  = "source.targetRevision"
          + type  = "string"
          + value = "HEAD"
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @mczaplinski, Action: `pull_request`*